import XinYongBettingCard from '../../../xin-yong-betting-card';
const {
	RECTANGLE,
} = XinYongBettingCard.TypeEnums;

const PlayConditionIdMap = {
	'兩面': 251,
	'单号1-10': 252,
	'冠亚军组合': 253,
};

const PlaySubconditionIdMap = {
	'兩面': {
		'冠、亚军和': 251001,
		'冠军': 251002,
		'亚军': 251003,
		'第三名': 251004,
		'第四名': 251005,
		'第五名': 251006,
		'第六名': 251007,
		'第七名': 251008,
		'第八名': 251009,
		'第九名': 251010,
		'第十名': 251011,
	},
	'单号1-10': {
		'冠军': 252001,
		'亚军': 252002,
		'第三名': 252003,
		'第四名': 252004,
		'第五名': 252005,
		'第六名': 252006,
		'第七名': 252007,
		'第八名': 252008,
		'第九名': 252009,
		'第十名': 252010,
	},
	'冠亚军组合': {
		'冠亚军组合': 253001,
	},
};

const PlaysMap = {
	'兩面': {
		'冠、亚军和': [
			{
				name: '大',
				id: 73000,
			},
			{
				name: '小',
				id: 73001,
			},
			{
				name: '单',
				id: 73002,
			},
			{
				name: '双',
				id: 73003,
			},
		],
		'冠军': [
			{
				name: '大',
				id: 73004,
			},
			{
				name: '小',
				id: 73005,
			},
			{
				name: '单',
				id: 73006,
			},
			{
				name: '双',
				id: 73007,
			},
			{
				name: '龙',
				id: 73008,
			},
			{
				name: '虎',
				id: 73009,
			},
		],
		'亚军': [
			{
				name: '大',
				id: 73010,
			},
			{
				name: '小',
				id: 73011,
			},
			{
				name: '单',
				id: 73012,
			},
			{
				name: '双',
				id: 73013,
			},
			{
				name: '龙',
				id: 73014,
			},
			{
				name: '虎',
				id: 73015,
			},
		],
		'第三名': [
			{
				name: '大',
				id: 73016,
			},
			{
				name: '小',
				id: 73017,
			},
			{
				name: '单',
				id: 73018,
			},
			{
				name: '双',
				id: 73019,
			},
			{
				name: '龙',
				id: 73020,
			},
			{
				name: '虎',
				id: 73021,
			},
		],
		'第四名': [
			{
				name: '大',
				id: 73022,
			},
			{
				name: '小',
				id: 73023,
			},
			{
				name: '单',
				id: 73024,
			},
			{
				name: '双',
				id: 73025,
			},
			{
				name: '龙',
				id: 73026,
			},
			{
				name: '虎',
				id: 73027,
			},
		],
		'第五名': [
			{
				name: '大',
				id: 73028,
			},
			{
				name: '小',
				id: 73029,
			},
			{
				name: '单',
				id: 73030,
			},
			{
				name: '双',
				id: 73031,
			},
			{
				name: '龙',
				id: 73032,
			},
			{
				name: '虎',
				id: 73033,
			},
		],
		'第六名': [
			{
				name: '大',
				id: 73034,
			},
			{
				name: '小',
				id: 73035,
			},
			{
				name: '单',
				id: 73036,
			},
			{
				name: '双',
				id: 73037,
			},
		],
		'第七名': [
			{
				name: '大',
				id: 73038,
			},
			{
				name: '小',
				id: 73039,
			},
			{
				name: '单',
				id: 73040,
			},
			{
				name: '双',
				id: 73041,
			},
		],
		'第八名': [
			{
				name: '大',
				id: 73042,
			},
			{
				name: '小',
				id: 73043,
			},
			{
				name: '单',
				id: 73044,
			},
			{
				name: '双',
				id: 73045,
			},
		],
		'第九名': [
			{
				name: '大',
				id: 73046,
			},
			{
				name: '小',
				id: 73047,
			},
			{
				name: '单',
				id: 73048,
			},
			{
				name: '双',
				id: 73049,
			},
		],
		'第十名': [
			{
				name: '大',
				id: 73050,
			},
			{
				name: '小',
				id: 73051,
			},
			{
				name: '单',
				id: 73052,
			},
			{
				name: '双',
				id: 73053,
			},
		],
	},
	'单号1-10': {
		'冠军': [
			{
				name: '01',
				id: 73054,
			},
			{
				name: '02',
				id: 73055,
			},
			{
				name: '03',
				id: 73056,
			},
			{
				name: '04',
				id: 73057,
			},
			{
				name: '05',
				id: 73058,
			},
			{
				name: '06',
				id: 73059,
			},
			{
				name: '07',
				id: 73060,
			},
			{
				name: '08',
				id: 73061,
			},
			{
				name: '09',
				id: 73062,
			},
			{
				name: '10',
				id: 73063,
			},
		],
		'亚军': [
			{
				name: '01',
				id: 73064,
			},
			{
				name: '02',
				id: 73065,
			},
			{
				name: '03',
				id: 73066,
			},
			{
				name: '04',
				id: 73067,
			},
			{
				name: '05',
				id: 73068,
			},
			{
				name: '06',
				id: 73069,
			},
			{
				name: '07',
				id: 73070,
			},
			{
				name: '08',
				id: 73071,
			},
			{
				name: '09',
				id: 73072,
			},
			{
				name: '10',
				id: 73073,
			},
		],
		'第三名': [
			{
				name: '01',
				id: 73074,
			},
			{
				name: '02',
				id: 73075,
			},
			{
				name: '03',
				id: 73076,
			},
			{
				name: '04',
				id: 73077,
			},
			{
				name: '05',
				id: 73078,
			},
			{
				name: '06',
				id: 73079,
			},
			{
				name: '07',
				id: 73080,
			},
			{
				name: '08',
				id: 73081,
			},
			{
				name: '09',
				id: 73082,
			},
			{
				name: '10',
				id: 73083,
			},
		],
		'第四名': [
			{
				name: '01',
				id: 73084,
			},
			{
				name: '02',
				id: 73085,
			},
			{
				name: '03',
				id: 73086,
			},
			{
				name: '04',
				id: 73087,
			},
			{
				name: '05',
				id: 73088,
			},
			{
				name: '06',
				id: 73089,
			},
			{
				name: '07',
				id: 73090,
			},
			{
				name: '08',
				id: 73091,
			},
			{
				name: '09',
				id: 73092,
			},
			{
				name: '10',
				id: 73093,
			},
		],
		'第五名': [
			{
				name: '01',
				id: 73094,
			},
			{
				name: '02',
				id: 73095,
			},
			{
				name: '03',
				id: 73096,
			},
			{
				name: '04',
				id: 73097,
			},
			{
				name: '05',
				id: 73098,
			},
			{
				name: '06',
				id: 73099,
			},
			{
				name: '07',
				id: 73100,
			},
			{
				name: '08',
				id: 73101,
			},
			{
				name: '09',
				id: 73102,
			},
			{
				name: '10',
				id: 73103,
			},
		],
		'第六名': [
			{
				name: '01',
				id: 73104,
			},
			{
				name: '02',
				id: 73105,
			},
			{
				name: '03',
				id: 73106,
			},
			{
				name: '04',
				id: 73107,
			},
			{
				name: '05',
				id: 73108,
			},
			{
				name: '06',
				id: 73109,
			},
			{
				name: '07',
				id: 73110,
			},
			{
				name: '08',
				id: 73111,
			},
			{
				name: '09',
				id: 73112,
			},
			{
				name: '10',
				id: 73113,
			},
		],
		'第七名': [
			{
				name: '01',
				id: 73114,
			},
			{
				name: '02',
				id: 73115,
			},
			{
				name: '03',
				id: 73116,
			},
			{
				name: '04',
				id: 73117,
			},
			{
				name: '05',
				id: 73118,
			},
			{
				name: '06',
				id: 73119,
			},
			{
				name: '07',
				id: 73120,
			},
			{
				name: '08',
				id: 73121,
			},
			{
				name: '09',
				id: 73122,
			},
			{
				name: '10',
				id: 73123,
			},
		],
		'第八名': [
			{
				name: '01',
				id: 73124,
			},
			{
				name: '02',
				id: 73125,
			},
			{
				name: '03',
				id: 73126,
			},
			{
				name: '04',
				id: 73127,
			},
			{
				name: '05',
				id: 73128,
			},
			{
				name: '06',
				id: 73129,
			},
			{
				name: '07',
				id: 73130,
			},
			{
				name: '08',
				id: 73131,
			},
			{
				name: '09',
				id: 73132,
			},
			{
				name: '10',
				id: 73133,
			},
		],
		'第九名': [
			{
				name: '01',
				id: 73134,
			},
			{
				name: '02',
				id: 73135,
			},
			{
				name: '03',
				id: 73136,
			},
			{
				name: '04',
				id: 73137,
			},
			{
				name: '05',
				id: 73138,
			},
			{
				name: '06',
				id: 73139,
			},
			{
				name: '07',
				id: 73140,
			},
			{
				name: '08',
				id: 73141,
			},
			{
				name: '09',
				id: 73142,
			},
			{
				name: '10',
				id: 73143,
			},
		],
		'第十名': [
			{
				name: '01',
				id: 73144,
			},
			{
				name: '02',
				id: 73145,
			},
			{
				name: '03',
				id: 73146,
			},
			{
				name: '04',
				id: 73147,
			},
			{
				name: '05',
				id: 73148,
			},
			{
				name: '06',
				id: 73149,
			},
			{
				name: '07',
				id: 73150,
			},
			{
				name: '08',
				id: 73151,
			},
			{
				name: '09',
				id: 73152,
			},
			{
				name: '10',
				id: 73153,
			},
		],
	},
	'冠亚军组合': {
		'冠亚军组合': [
			{
				name: '大',
				id: 73280,
			},
			{
				name: '小',
				id: 73281,
			},
			{
				name: '单',
				id: 73278,
			},
			{
				name: '双',
				id: 73279,
			},
			{
				name: '03',
				id: 73254,
			},
			{
				name: '04',
				id: 73255,
			},
			{
				name: '05',
				id: 73256,
			},
			{
				name: '06',
				id: 73257,
			},
			{
				name: '07',
				id: 73258,
			},
			{
				name: '08',
				id: 73259,
			},
			{
				name: '09',
				id: 73260,
			},
			{
				name: '10',
				id: 73268,
			},
			{
				name: '11',
				id: 73269,
			},
			{
				name: '12',
				id: 73270,
			},
			{
				name: '13',
				id: 73271,
			},
			{
				name: '14',
				id: 73272,
			},
			{
				name: '15',
				id: 73273,
			},
			{
				name: '16',
				id: 73274,
			},
			{
				name: '17',
				id: 73275,
			},
			{
				name: '18',
				id: 73276,
			},
			{
				name: '19',
				id: 73277,
			},
		],
	},
};

export default {
	PlayConditionIdMap,
	PlaySubconditionIdMap,
	PlaysMap,
};
