module.exports = [
	{
		"id": 1000000,
		"name": "邮政储汇"
	},
	{
		"id": 1020000,
		"name": "工商银行"
	},
	{
		"id": 1030000,
		"name": "农业银行"
	},
	{
		"id": 1040000,
		"name": "中国银行"
	},
	{
		"id": 1050000,
		"name": "建设银行"
	},
	{
		"id": 3010000,
		"name": "交通银行"
	},
	{
		"id": 3020000,
		"name": "中信银行"
	},
	{
		"id": 3030000,
		"name": "光大银行"
	},
	{
		"id": 3040000,
		"name": "华夏银行"
	},
	{
		"id": 3050000,
		"name": "民生银行"
	},
	{
		"id": 3060000,
		"name": "广发银行"
	},
	{
		"id": 3070010,
		"name": "平安银行"
	},
	{
		"id": 3080000,
		"name": "招商银行"
	},
	{
		"id": 3090000,
		"name": "兴业银行"
	},
	{
		"id": 3100000,
		"name": "浦发银行"
	},
];
